import React from "react";
import iphones from '../../../img/ip.jpg'
import './NewsIphone.css'

export default function NewsIphone() {
  return (
    <div>
      <div className="news">
        <div className="news-title">ЩО НОВОГО</div>
        <div className="news-items">
          <div className="news-item">
            <p>
              Всі моделі оснащені однокристальною системою A16 Bionic, 48-{" "}
              <br/>
                мегапіксельною основною камерою та екранами ProMotion із
                захистом Ceramic{" "}
              <br/>{" "}
              Shield та частотним діапазоном 1 – 120 Гц, а також прискореною
              пам'яттю <br /> LPDDR5. Дизайн лінійки оновлено, на фронтальній
              панелі смартфонів два <br /> вирізи{" "}
            </p>
            <p> Всі iPhone 14 в США
                будуть продаватися без лотка для SIM-карток: виробник <br/> заявляє, що
                покращена технологія eSIM дозволить перенести старі <br/> електронні
                сім-картки на нові смартфони. 
                
               </p>
             <p> Оновлено фронтальну камеру вона
                оснащена автофокусом і швидше <br/> розпізнає користувача в умовах
                недостатнього освітлення та сенсор <br/> основної камери.</p>
            <p className="text-bold">
                iPhone 14 Pro вийшов у новому дизайні - без <br/> фірмової «чубчика». Також
                в асортименті з'явився <br/> новий колір. У смартфоні, на відміну від
                "звичайних" 14- <br/>х айфонів, встановлений процесор A16 Bionic, який <br/>
                може за секунду робити 4 трлн операцій із <br/>фото.
              </p>
          </div>
          <div class="news-item">
            <img
              src={iphones}
              className="news-images"
            />
          </div>
        </div>
      </div>
    </div>
  );
}
