import React from "react";
import "./About.css";

const About = () => {
  return (
    <div className="about-wrapper">
      <section className="about-us">
        <h2>Про нас</h2>
        <p>
          Магазин Сота - студія техніки пропонує широкий асортимент сучасної
          техніки від провідних виробників. Ми працюємо для того, щоб
          забезпечити наших клієнтів найновішими та найвисокоякіснішими
          продуктами.
        </p>
        <p>
          Наша команда професіоналів завжди готова допомогти вам з вибором,
          надаючи вичерпну інформацію та консультації. Ми прагнемо створити
          для вас комфортне та захоплююче досвід покупок.
        </p>
      </section>

      <section className="store-info">
        <h2>Контактна інформація</h2>
        <p>
          <strong>Адреса:</strong> вул. Бродівська, 14, м. Тернопіль
        </p>
        <p>
          <strong>Телефон:</strong> (097) 461-39-97
        </p>
        <p>
          <strong>Email:</strong> studiatehnikisota@gmail.com
        </p>
      </section>

      <section className="our-products">
        <h2>Про наші товари</h2>
        <p>
          У магазині Сота - студія техніки ми пропонуємо тільки високоякісні
          товари від найкращих брендів. Ми дбаємо про те, щоб кожен продукт,
          який ми продаємо, відповідав найвищим стандартам якості та
          надійності.
        </p>
        <p>
          Наш асортимент включає продукцію таких відомих брендів, як
          SilverCrest, Elenberg, Magio, Bosch, Sea Breeze та багато інших. Ми
          пишаємося тим, що можемо пропонувати клієнтам лише високоякісну
          побутову техніку, яка відповідає сучасним стандартам і технологіям.
        </p>
        <p>
          Завдяки нашому вибору та фаховому підходу, ви можете бути впевнені,
          що купуючи в нашому магазині, ви отримуєте продукт, який
          задовольнить ваші потреби та прослужить вам довго.
        </p>
      </section>
    </div>
  );
};

export default About;